#X~N(40,18^2) n=36 (표본평균분포)
#Xbar~N(40,3^2), P(34<Xbar<43) =?

pnorm(43,40,3)-pnorm(34,40,3)

#7 chisq (1), (3) 단일 (카이스퀘어분포)

qchisq(0.95,4)# 상위 5퍼
qchisq(0.025,16) # 하위 2.5퍼

#8 V~chisq2(20) 누적

1-pqhisq(31.4104,20)
pchisq(28.4120)-pchisq(9.5908,20)

#9 (2), (4) (T분포)


qt(0.9,12) #T 값 찾기. 확률 찾으려면 pt
qt(0.025,7)

#10 T~t(25)

pt(1.316,25)
pt(2.787,25)-pt(1.708,25)

###### 확률밀도 그래프 그리기 (미출제)

curve(dchisq(x,4),0,15) #dchisq: 한개한개의 확률밀도 계산, 2,3번째 매개변수: 범위

curve(dnorm(x),-5,5) #정규분포 그래프
curve(dt(x,4),-5,-5,add=T) # add 옵션: 윗줄에서 그린 그래프에 추가로 그리기