# p.102 #12-(1)
# X~N(100, 8^2)

#P(90<x<110)

pnorm(110,100,8)-pnorm(90,100,8)

#P(|x|>=c)=0.10

c1=qnorm(0.05,100,8)
c1

c2=qnorm(0.95,100,8)
c2

#ex6-9

#이항분포 X ~ B(100,0.5), np=50, np(1-p)=25

pbinom(40,100,0.5)-pbinom(19,100,0.5)

#연속성수정 없이
pnorm(40,50,5)-pnorm(20,50,5) #차이가 엄청 크진 않음

#연속성수정 하고 (40,20을 포함시키기 위해)
pnorm(40.5,50,5)-pnorm(19.5,50,5)

#ex6-10

# X~B(100,0.8), np=80, np(1-p)=16

#이항분포

  #P(X<74) : 최대 73명
   pbinom(73,100,0.8)

  #(74<=X<=85)
   pbinom(85,100,0.8)-pbinom(73,100,0.8)

#정규분포 이항 73, 정규 74그대로 사용하는거 주의
  #P(X<74)  
   pnorm(74,80,4)
  #(74<=X<=85)
   pnorm(85,80,4)-pnorm(74,80,4)

#연속성 수정 후
  #P(X<74)  
   pnorm(73.5,80,4)
  #(74<=X<=85)
   pnorm(85.5,80,4)-pnorm(73.5,80,4) # 0.863353

# 104p #19

# X~B(500,0.1) np=50, np(1-p)=50*0.9=45 -> X~N(50,45) sqrt: 루트 기호
#P(X>40)
 #이항분포
  1-pbinom(40,500,0.1) #40보다 클 확률 구하는거니까 40까지 누적된 확률 빼기
 #정규분포
  1-pnorm(40,50,sqrt(45))
 #연속성 수정 후
  1-pnorm(40.5,50,sqrt(45))

# 105p #25

# X~N(500,100^2)
 qnorm(0.05,500,100) #335.5 -> 336일로 보증기간정해야함
