
# 이항분포, np(1-p)
dbinom(x=8,size=20,prob=0.3) (x: 성공횟수, size: 시행횟수, prob: 성공확률)
#순서대로 입력만 하면 인자이름? 생략가능
dbinom(8,20,0.3) # p(X=8)

#누적확률계산
pbinom(8,20,0.3) # p(X<=8)
pbinom(8,20,0.3)-pbinom(7,20,0.3) #P(X=8)

#초기하분포 
#ex6-1
dhyper(x=0,m=2,n=3,k=2) # p(X=0) (m:진짜개수 n:가짜개수 k:시행횟수)
dhyper(x=1,m=2,n=3,k=2) # p(X=1)
dhyper(x=2,m=2,n=3,k=2) # p(X=2)

dhyper(x=0,m=6,n=39,k=6) # p(X=0)
dhyper(x=1,m=6,n=39,k=6) # p(X=1)
dhyper(x=2,m=6,n=39,k=6) # p(X=2)
dhyper(x=3,m=6,n=39,k=6) # p(X=3)
dhyper(x=4,m=6,n=39,k=6) # p(X=4)
dhyper(x=5,m=6,n=39,k=6) # p(X=5)
dhyper(x=6,m=6,n=39,k=6) # p(X=6)

#로또 샀을때 꽝일 확률을 계산하세요: 2개까지 꽝임 (누적확률 약속: x대신 p 쓰기)
phyper(q=2,m=6,n=39,k=6) # p(X<=2)

#연습 1
dhyper(x=0,m=8,n=7,k=5) # p(X=0)
dhyper(x=1,m=8,n=7,k=5) # p(X=1)
dhyper(x=2,m=8,n=7,k=5) # p(X=2)
dhyper(x=3,m=8,n=7,k=5) # p(X=3)
dhyper(x=4,m=8,n=7,k=5) # p(X=4)
dhyper(x=5,m=8,n=7,k=5) # p(X=5)

#연습 3-(1)
dbinom(2,5,0.3)

#연습 3-(2)
#p = 0.7일 때 18번 중에 6번 실패할 확률 = 18번 중에 12번 성공할 확률
dbinom(12,18,0.7)
dbinom(6,18,0.3)

#연습 3-(4)
#p=0.7, 누적확률로 계산
pbinom(15,20,0.7)-pbinom(8,20,0.7)

#연습 5 : 10개 문항 중 6개 이상 맞으면 합격, 각 문제당 확률 1/5
1-pbinom(5,10,0.2)


#연습 7: 포아송분포. 변수x, 평균만 필요
dpois(1,3) # p(X=1)
ppois(5,3) # p(X<=5)

#연습 8 평균2.5, 5명 결근할 확률 (이해안가)
1-ppois(4,2.5)

#연습 9 (이항, 초기하 근사 비교)
1-pbinom(4,100000,0.0001)
m=100000*0.0001
1-ppois(4,m)